In [1]:
# Dependencies
import pandas as pd
import numpy as np

In [2]:
cd python-challenge

C:\Users\craig\Desktop\PythonCode\python-challenge

In [3]:
cd pySchool

C:\Users\craig\Desktop\PythonCode\python-challenge\pySchool

In [4]:
# Load in file
data_file = "schools_complete.csv"

In [5]:
# Create DataFrame from CSV
df = pd.read_csv(data_file)
df.head()

   School ID                   name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [6]:
# Change header "name" to "school" in data_file
df=df.rename(columns = {'name':'school'})
df.head()

   School ID                 school      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [7]:
# Load in file
data_file2 = "students_complete.csv"

In [8]:
# Create DataFrame from CSV
df2 = pd.read_csv(data_file2)
df2.head()

,Student ID,name,gender,grade,school,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66.0,79.0
1,1,Victor Smith,M,12th,Huang High School,94.0,61.0
2,2,Kevin Rodriguez,M,12th,Huang High School,90.0,60.0
3,3,Dr. Richard Scott,M,12th,Huang High School,67.0,58.0
4,4,Bonnie Ray,F,9th,Huang High School,97.0,84.0

In [59]:
# Merge the two created data frames on the name of tbe school
merged_df = pd.merge(df, df2, on = "school", how="outer")
merged_df.head()

,School ID,school,type,size,budget,Student ID,name,gender,grade,reading_score,math_score
0,0.0,Huang High School,District,2917.0,1910635.0,0,Paul Bradley,M,9th,66.0,79.0
1,0.0,Huang High School,District,2917.0,1910635.0,1,Victor Smith,M,12th,94.0,61.0
2,0.0,Huang High School,District,2917.0,1910635.0,2,Kevin Rodriguez,M,12th,90.0,60.0
3,0.0,Huang High School,District,2917.0,1910635.0,3,Dr. Richard Scott,M,12th,67.0,58.0
4,0.0,Huang High School,District,2917.0,1910635.0,4,Bonnie Ray,F,9th,97.0,84.0

In [58]:
# Use Map to format all the columns
#merged_df["budget"] = merged_df["budget"].map("${:2f}".format)
#merged_df.head

In [61]:
# Total Schools by Disrict Summary
school_count = merged_df.groupby(['type'])['school'].nunique()
school_count

type
Charter     8
District    7
Name: school, dtype: int64

In [62]:
# Total Students
student_count = merged_df.groupby(['type'])['name'].nunique()
student_count

type
Charter     10967
District    23558
Name: name, dtype: int64

In [77]:
# Total Budget
budget_total = merged_df.groupby(['type'])['budget'].sum()
budget_total

type
Charter     1.204473e+10
District    7.043905e+10
Name: budget, dtype: float64

In [36]:
# Calc average math score at district level
avgmathgrade = merged_df.groupby(['type'])['math_score'].mean()
avgmathgrade

type
Charter     83.387963
District    76.987026
Name: math_score, dtype: float64

In [37]:
# Calc average reading score at district level
avgreadinggrade = merged_df.groupby(['type'])['reading_score'].mean()
avgreadinggrade

type
Charter     83.901564
District    80.962485
Name: reading_score, dtype: float64

In [72]:
# Count Passing Math
mathPass_count = merged_df[merged_df.math_score > 70].groupby('type')['math_score'].count()
mathPass_count

type
Charter     27.400620
District    44.778007
Name: math_score, dtype: float64

In [89]:
# Percent Passing Math
#math_Pass_Percent = (mathPass_count / merged_df['math_score'].count() * 100)
#math_Pass_Percent

In [75]:
# Count Passing Reading
readingPass_count = merged_df[merged_df.reading_score > 70].groupby('type')['reading_score'].count()
readingPass_count

type
Charter     10961
District    21141
Name: reading_score, dtype: int64

In [76]:
# Percent Passing Reading
reading_Pass_Percent = (readingPass_count / merged_df['reading_score'].count() * 100)
reading_Pass_Percent

type
Charter     28.293753
District    54.571502
Name: reading_score, dtype: float64

In [96]:
# Overall Passing Rate
#overallPass_rate = merged_df["math_Pass_Percent" + "reading_Pass_Percent"].mean()
#overallPass_rate

In [92]:
# Create a new table consolodating above calculations
district_breakdown = merged_df({"District Results": [district_breakdown],
                                   "Total Schools": [school_count],
                                   "Total Students": [student_count],
                                   "Total Budget": [budget_total],
                                   "Average Math Score": [avgmathgrade],
                                   "Average Reading Score":[avgreadinggrade],
                                   "% Passing Math":[math_Pass_Percent],
                                   "% Passing Reading": [readingPass_count],
                                   "Overall Passing Rate": [overallPass_rate]
}
                              )
district_breakdown

NameError: name 'district_breakdown' is not defined

In [94]:
# Total students by School 
student_count = merged_df.groupby(['school'])['student ID'].nunique()
student_count

KeyError: 'Column not found: student ID'

In [88]:
# Total Budget by School
budget_total = merged_df.groupby(['school'])['budget'].sum()
budget_total

school
Bailey High School       1.554964e+10
Cabrera High School      2.009159e+09
Figueroa High School     5.557128e+09
Ford High School         4.831366e+09
Griffin High School      1.346890e+09
Hernandez High School    1.400706e+10
Holden High School       1.059331e+08
Huang High School        5.573322e+09
Johnson High School      1.473363e+10
Pena High School         5.635954e+08
Rodriguez High School    1.018690e+10
Shelton High School      1.860673e+09
T                                 NaN
Thomas High School       1.256972e+09
Wilson High School       3.012587e+09
Wright High School       1.888920e+09
Name: budget, dtype: float64

In [97]:
# Calc average math score at School level
avgmathgrade_school = merged_df.groupby(['school'])['math_score'].mean()
avgmathgrade_school

school
Bailey High School       77.048432
Cabrera High School      83.061895
Figueroa High School     76.711767
Ford High School         77.102592
Griffin High School      83.351499
Hernandez High School    77.289752
Holden High School       83.803279
Huang High School        76.629414
Johnson High School      77.072464
Pena High School         83.839917
Rodriguez High School    76.842711
Shelton High School      83.359455
T                              NaN
Thomas High School       83.244813
Wilson High School       83.274201
Wright High School       83.682222
Name: math_score, dtype: float64

In [98]:
# Calc average reading score at School level
avgreadinggrade_school = merged_df.groupby(['school'])['reading_score'].mean()
avgreadinggrade_school

school
Bailey High School       81.033963
Cabrera High School      83.975780
Figueroa High School     81.158020
Ford High School         80.746258
Griffin High School      83.816757
Hernandez High School    80.934412
Holden High School       83.814988
Huang High School        81.182722
Johnson High School      80.966394
Pena High School         84.044699
Rodriguez High School    80.744686
Shelton High School      83.725724
T                              NaN
Thomas High School       83.817427
Wilson High School       83.989488
Wright High School       83.955000
Name: reading_score, dtype: float64